---
kind: method
id: M:Autodesk.Revit.DB.SolidOrShellTessellationControls.DisableLevelOfDetail
source: html/cfe32d33-bd03-812f-9ec3-a1833277c399.htm
---
# Autodesk.Revit.DB.SolidOrShellTessellationControls.DisableLevelOfDetail Method

Disables the use of levelOfDetail. The use of levelOfDetail is enabled by calling setLevelOfDetail (with a valid input).

## Syntax (C#)
```csharp
public void DisableLevelOfDetail()
```